WcfHarness/WcfHarness/RequestXmls/DeleteAPIKey.xml

<?xml version="1.0" encoding="utf-8" ?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <DeleteAPIKey xmlns="http://www.tavisca.com/Vexiere/IAPIKey/2013/01">
      <deleteAPIKeyRequest xmlns:a="http://schemas.datacontract.org/2004/07/Tavisca.Vexiere.DataContract" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <a:AdditionalData i:nil="true"/>
        <a:APIKey>MGJhMmMzNmYtY2YzZC00YWE3LWExZjUtOWEzMjE5YmM1ZGVi</a:APIKey>
      </deleteAPIKeyRequest>
    </DeleteAPIKey>
  </s:Body>
</s:Envelope>